# Assignment - NO: 1

### Muhammad Taha Amer

### 2.1 Variables

In [2]:
counter = 100.00 #float type variable
miles = 100 #integer type variable
name = "Mehvish" #string type variable

#print all values
print (counter)
print (miles)
print (name)

100.0
100
Mehvish

### 2.2 Numbers

In [3]:
2 #integer

2

In [4]:
2+3 #integer

5

In [5]:
2.3+5.5 #float

7.8

In [7]:
2*2 #exponent

4

### 2.3 Strings

In [8]:
name = 'Mehvish'
university = "COMSATS"
print (name,university)

Mehvish COMSATS

## Access Values in String

In [16]:
stringVariable = 'Hello World'
print("stringVariable[0]:" , stringVariable[0])
print("stringVariable[1:5]:" , stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

## Updating String

In [20]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"
print("Updated string: ", stringVariable)

Updated string:  Hello Python

## Delete String

In [33]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable

Hello World

## String Special Characters
### '+' operator is used for concatenation.

In [34]:
variable = "Hello World"
print(variable + "python")

Hello Worldpython

### '*' used of Repetition

In [38]:
variable = "python"
print (variable *3)

pythonpythonpython

### '[]' give the character of string at given index.

In [39]:
variable = "Hello"
print(variable[1])

e

### [:]' variable is used to get a range of characters from string.

In [41]:
variable = "Hello World"
print(variable[2:8])

llo Wo

### 'in' returns true if given character doesn't exists in string, otherwise false.

In [46]:
variable = "Taha"
print('M' not in variable)

True

# String formatting operator

### One of the coolest feature is string formatting operator within print statement.
 See following example:

In [48]:
print ("My name is %s and age is %d kg!" % ("Taha", 21))

My name is Taha and age is 21 kg!

### 2.4 Lists

In [3]:
list1 = ['Taha', '1999']
print(list1)

['Taha', '1999']

## Accessing Values in Lists

In [6]:
list1 = ['Physics', 'Chemistry', 'Maths'];
list2 = [1, 2, 3];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  Physics
list2[1:5]:  [2, 3]

## Updating List

In [7]:
list1 = ['physics' , 'chemistry', 'Biology']
list1[1] = "computer science"
print(list1)
list1.append('computer science')
print(list1)

['physics', 'computer science', 'Biology']
['physics', 'computer science', 'Biology', 'computer science']

## Delete List element

In [13]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1)

del list1[2];

print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

## 2.5 Dictionaries

In [19]:
dict = {'Name':"Taha" , 'Depart': "Bsc EE", 'Batch': 2019}
print (dict['Name'])

Taha

## Updating Dictionary

In [21]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict) 
dict['University'] = "COMSATS" 
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

## Delete Dictionary Element

In [22]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014} 
print (dict) 
del dict['Batch'] 
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [23]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014} 
dict.clear() 
print (dict)

{}

### 2.6 Tuples

In [24]:

 tup = ('Math','98', 'C programming', '99')
 print (tup)

('Math', '98', 'C programming', '99')

In [26]:

tup = ('Math','98', 'C programming', '99')
print (tup) 
print(tup[1]) 
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

## Updating Tuples

In [27]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');

#Following action is not valid for tuples 
#tup1[0] = 100; 
#So let's create a new tuple as follows

tup3 = tup1 + tup2; 
print (tup3);

(12, 34.56, 'abc', 'xyz')

## Delete Tuple elements

In [2]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

In [31]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);

('physics', 'chemistry', 1997, 2000)

In [32]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;

('physics', 'chemistry', 1997, 2000)

In [33]:
tup = ('physics', 'chemistry', 1997, 2000);
del tup;

### 2.7 Sets

In [2]:
#list
list1 = [1,2,3,4,5]
print(type(list1))
my_set = set(list1)
print(my_set)

<class 'list'>
{1, 2, 3, 4, 5}

In [3]:
#set of integers
my_set = {1,2,3}
print (my_set)

{1, 2, 3}

In [4]:
#set of mixed data types
my_set = {1, 'Hello' , 1.2 , 'C'}
#adding a single value
my_set.add('D')
#adding multiple values
my_set.update(list1)
print(my_set)

{'Hello', 1, 1.2, 2, 3, 4, 5, 'C', 'D'}

## Comparison Operators

In [5]:
1<3

True

In [6]:
15 <= 23

True

In [7]:
 'Mehvish' == "Zeenat"

False

In [8]:
"Mehvish" != "Mehvish"

False

In [9]:
(1==1)or(5>2)

True

In [10]:
(1<2)and(2<1)

False

## If-Else Statements

In [14]:
if 25 % 2: 
    print('Even')
else: 
    print('Odd')

Even

## For and While Loop

In [17]:
#example of for loop
fact = 1
N = 5
for i in range (1,N+1): 
    fact*=i 
print (fact)

120

In [20]:
#example of while loop
a = 0
while a < 10: 
    a = a+1
    print(a)

1
2
3
4
5
6
7
8
9
10

##  Functions

In [25]:
#Function Definition is HERE
def printme(str):
#This prints a passed string into this function
   print (str)
   return;
#Now you can call printme function
printme ("I'm first call user defined function!")

I'm first call user defined function!

##  Lambda Functions

In [30]:
#Normal Function
def f (x):
    return x**2
print (f(8))

64

In [32]:
#Lambda Function
#Lambda Expressions
times3 = lambda var:var*3
times3(10)

30

## 7.1 Map()

In [35]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print(words)

lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

## 7.2 Filter()

In [36]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [37]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result2 = filter(lambda x: x % 2 == 0, fib) 
list (result2)

[0, 2, 8, 34]

## File I/O

In [40]:
from six.moves import input
string = input ("Enter your Name");
print (string)

Enter your Name Taha

Taha

## I/O from or to Text File

In [4]:
# Open a file to read
fileOpen = open("file.txt.txt","r+")
str = fileOpen.read();
print(str)
fileOpen.close()

1 2 3 4 5 6

In [14]:
# Open a file to append
fileOpen = open("file1.txt.txt", "a+")
fileOpen.write(" Information Technology Lahore");
fileOpen.close()
# Open a file to read
fileOpen = open("file.txt.txt", "r+")
string = fileOpen.read(); 
#to read specific content from start you can use read(12). 
# It will read 12 characters from the start of file
print (string)
# Close opend file

1 2 3 4 5 6

## File Position

In [23]:
# Open a file
fo = open("file1.txt.txt", "r+")
str = fo.read(10);
print("ReadStringis:\n",str)
# Check current position
position = fo.tell();
print("Currentfileposition:\n", position)
#Repositionpointeratthebeginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print("AgainreadStringis:\n", str)
# Close opend file
fo.close()

ReadStringis:
 Taha Amer
Currentfileposition:
 9
AgainreadStringis:
 Taha Amer

In [26]:
import os

In [28]:
import os
# renameafile
os.rename("file.txt.txt","renamefile.txt")

PermissionError: [WinError 32] The process cannot access the file because it is being used by another process: 'file.txt.txt' -> 'renamefile.txt'

## 9. Pandas Introduction Done

## 10. Series

### 10.1 From ndarray

In [30]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
"""following a fucntion is called from panas to create a series.
data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.182247
b   -0.239999
c    0.640343
d    0.845657
e   -0.627893
dtype: float64

In [33]:
 ##Following function will print the index and its datatype
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [34]:
##3If we don't assign the index then it will of length having values [0.
pd.Series(np.random.randn(5))

0   -1.137392
1   -0.689610
2   -1.220364
3    0.755426
4   -0.171187
dtype: float64

### 10.2 From dict

In [35]:
### In following example, indexes are not given to it is constructed from the sorted keys of the dict
d = {'Taha' : 0., 'Amer' : 1., 'c' : 2.} # a python dict
pd.Series(d)

Taha    0.0
Amer    1.0
c       2.0
dtype: float64

In [36]:
 ##3In following example, index are given, so the values in data corresponding in the index will be pulled out
pd.Series(d, index=['Cyber', 'Gen', 'Taha', 'AI DEVELOPER'])

Cyber           NaN
Gen             NaN
Taha            0.0
AI DEVELOPER    NaN
dtype: float64

### 10.3 From a scalar value

In [37]:
 ###In following example, a scalar value is given as data so it will be repeated to match the length of index
pd.Series(5., index=['a', 'e', 'i', 'o', 'u'])

a    5.0
e    5.0
i    5.0
o    5.0
u    5.0
dtype: float64

### 10.4 Series is ndarray-like

In [48]:
#we can access a value just like ndarray
#access single value
s.iloc[0]

np.float64(0.18224713273240617)

In [42]:
#access range of values
s[:5]

a    0.182247
b   -0.239999
c    0.640343
d    0.845657
e   -0.627893
dtype: float64

In [43]:
 ###Following example will return a range of values in series whose value is greater than the median of series
s[s > s.median()]

c    0.640343
d    0.845657
dtype: float64

In [45]:
s.iloc[[4, 3, 1]]  # ✅ Correct and future-proof

e   -0.627893
d    0.845657
b   -0.239999
dtype: float64

In [49]:
###Following example returns the exponent values. just like e^a (here a is index and its respective data is placed here)
np.exp(s)

a    1.199911
b    0.786628
c    1.897131
d    2.329508
e    0.533715
dtype: float64

In [50]:
## Following example will get the data of given index"""
s['a']

np.float64(0.18224713273240617)

In [51]:
import pandas as pd

# Example Series with specific index and values
s = pd.Series({'a': -0.4099336125957855, 'b': 0.25, 'c': 0.7})

# Get value at index 'a'
print(s['a'])  # ✅ Output: -0.4099336125957855

-0.4099336125957855

In [52]:
## Following example will get the data of given index"""
s['a']

np.float64(-0.4099336125957855)

In [53]:
##3Following example will update the data of the given index"""
s['e'] = 12.
s # before updating e = 1.399281 but after updating e = 12.000000

a    -0.409934
b     0.250000
c     0.700000
e    12.000000
dtype: float64

In [54]:
 ### Following will return true if 'e' is in the values of index otherwise false
'e' in s

True

In [57]:
## If a label is not contained and you are trying to access its data, an exception is raised: 
s['f']
# This will create error

KeyError: 'f'

In [56]:
###Using the get method, a missing label will return None or specified default
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

### 10.6 Vectorized operations and label alignment with Series

In [58]:
"""following will add the data of respective values of indexes. For example, in given output, it is calculate
d as: a = s['a'] +
s['a'] b = s['b'] +
s['b'] c = s['c'] +
s['c'] d = s['d'] +
s['d'] e = s['e'] +
s['e']
"""
s + s

a    -0.819867
b     0.500000
c     1.400000
e    24.000000
dtype: float64

In [59]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca
lculated as:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2"""
s * 2

a    -0.819867
b     0.500000
c     1.400000
e    24.000000
dtype: float64

In [64]:
s = pd.Series(np.random.randn(5), name='CyberGEN AI Developers Boot Camp')
s

0    0.155836
1    0.758400
2    1.174211
3   -0.637707
4    1.009269
Name: CyberGEN AI Developers Boot Camp, dtype: float64

In [62]:
s.name #print the name attribute of series

'something'

In [63]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects.
s2 = s.rename("TAHA AMER")
s2.name

'TAHA AMER'

## 11. Data Frames

### 11.1 From dict of Series or dicts

In [65]:
""" A dict is created """
d = {
'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it
will be sorted list of dict keys"""
df=pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [70]:
###A data frame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [69]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [71]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [72]:
 df.columns

Index(['one', 'two'], dtype='object')

### 11.2 From dict of ndarrays / lists

In [75]:
"""following examples shows that ndarray has same length"""
d = {
'one' : [1., 2., 3., 4.],
'two' : [4., 3., 2., 1.]
}
"""column labels are not given so the result will be range(n), where n is the array length"""
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [76]:
"""If indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

### 11.3 From a list of dicts

In [77]:
"""constructing data frame from a list of dicts"""
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [79]:
"""passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [80]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

### 11.4 From a dict of tuples

In [83]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
               ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
               ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
               ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
               ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})
#"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

### 11.5 Alternate Constructors

In [88]:
import numpy as np

data = np.zeros((2,), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'S10')])
print(data)

[(0, 0., b'') (0, 0., b'')]

In [90]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

C:\Users\Cd Inn\AppData\Local\Temp\ipykernel_9612\1791032826.py:1: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [95]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

In [97]:
import pandas as pd

df = pd.DataFrame([ [1, 4], [2, 5], [3, 6] ], columns=['A', 'B'])
print(df)

   A  B
0  1  4
1  2  5
2  3  6

### 11.6 Column selection, addition, deletion

In [104]:
df['one'] # it is displaying data under coloumn 'one'

A    1
B    4
Name: one, dtype: int64

In [106]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

In [107]:
df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [108]:
df #print a complete data frame

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [109]:
df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [110]:
df

   one  two  three   flag  foo
A    1    2      2  False  bar
B    4    5     20   True  bar

In [111]:
"""following example will take values from coloumn one until give range and will populate the new coloumn"""
df['one_trunc'] = df['one'][:2]

In [112]:
df

   one  two  three   flag  foo  one_trunc
A    1    2      2  False  bar          1
B    4    5     20   True  bar          4

In [113]:
"""following function has three arguments.
First argument: index where new coloumn will be inserted.
Second argument: label or title of a new coloumn
Third argument: it will create a coloumn at specified position"""
df.insert(1, 'bar2', df['one'])

In [114]:
df

   one  bar2  two  three   flag  foo  one_trunc
A    1     1    2      2  False  bar          1
B    4     4    5     20   True  bar          4

### 11.7 Indexing / Selection

In [116]:
df.loc['b'] #it will return the coloumn labels and values on row label 'b'

KeyError: 'b'

In [117]:
print(df.index)

Index(['A', 'B'], dtype='object')

In [123]:
df.loc['B']

one             4
bar2            4
two             5
three          20
flag         True
foo           bar
one_trunc       4
Name: B, dtype: object

In [124]:
print(len(df))         # shows total number of rows
print(df.shape)        # (rows, columns)
print(df)              # check the whole DataFrame

2
(2, 7)
   one  bar2  two  three   flag  foo  one_trunc
A    1     1    2      2  False  bar          1
B    4     4    5     20   True  bar          4

In [129]:
df.iloc[2] #it will return the values of those coloumns that is > than 2

IndexError: single positional indexer is out-of-bounds

In [130]:
print(df)
print(df.shape)   # shows (rows, columns)

   one  bar2  two  three   flag  foo  one_trunc
A    1     1    2      2  False  bar          1
B    4     4    5     20   True  bar          4
(2, 7)

In [132]:
import pandas as pd

df = pd.DataFrame({
    'A': [1, 4, 3],
    'B': [2, 5, 1]
})

print(df.iloc[2])     # ✅ valid: third row
print(df[df > 2])     # ✅ shows values > 2

A    3
B    1
Name: 2, dtype: int64
     A    B
0  NaN  NaN
1  4.0  5.0
2  3.0  NaN

In [133]:
df.iloc[2]  # it will return the values of those columns that is > than 2

A    3
B    1
Name: 2, dtype: int64

### 11.8 Data alignment and arithmetic

In [134]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [135]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [136]:
df + df2 # add values of respective coloumn labels

          A         B         C   D
0  1.846483  2.302907  0.251073 NaN
1 -0.605726 -2.656575  1.421123 NaN
2  0.707641  0.681107 -0.043319 NaN
3 -1.380478  2.212260  0.563326 NaN
4  1.218811  0.435906 -0.242403 NaN
5  1.137630 -0.461277 -0.281098 NaN
6 -0.390676 -0.067140 -2.440443 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [137]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  1.212954 -0.367209  0.881188  0.355356
2  1.832981  1.037226  0.388425  1.143564
3  1.489832  1.163666  0.522307  0.045673
4  0.645717 -0.637493 -1.107383 -1.193509
5 -0.069497  0.244892  0.873453  0.133967
6 -0.547009 -0.575457 -0.984031  1.140953
7  2.195163  2.645516  0.060119 -0.426720
8  0.941010  0.491545 -0.145661 -0.775048
9 -0.218499  0.374885 -0.645427 -1.119320

In [138]:
df*5+2

          A          B         C          D
0 -1.398356   1.045144  0.408937   4.628369
1  4.666412  -0.790902  4.814879   6.405151
2  7.766551   6.231272  2.351063  10.346190
3  6.050802   6.863476  3.020474   4.856734
4  1.830228  -2.142322 -5.127976  -1.339174
5 -1.745842   2.269605  4.776201   5.298206
6 -4.133403  -1.832141 -4.511217  10.333134
7  9.577461  14.272727  0.709531   2.494767
8  3.306692   3.502869 -0.319366   0.753130
9 -2.490850   2.919570 -2.818200  -0.968230

In [139]:
1 / df

           A          B          C          D
0  -1.471300  -5.236394  -3.142554   1.902320
1   1.875179  -1.791536   1.776275   1.135035
2   0.867069   1.181678  14.242443   0.599076
3   1.234323   1.028071   4.899682   1.750251
4 -29.451244  -1.207053  -0.701461  -1.497376
5  -1.334813  18.545665   1.801022   1.515976
6  -0.815208  -1.304754  -0.767906   0.600014
7   0.659852   0.407407  -3.874560  10.105768
8   3.826456   3.326970  -2.155761  -4.010042
9  -1.113375   5.437325  -1.037732  -1.684506

In [140]:
df **4

          A          B         C         D
0  0.213400   0.001330  0.010253  0.076360
1  0.080878   0.097073  0.100452  0.602508
2  1.769230   0.512866  0.000024  7.763778
3  0.430808   0.895173  0.001735  0.106561
4  0.000001   0.471081  4.130331  0.198919
5  0.315005   0.000008  0.095044  0.189335
6  2.264259   0.345053  2.875865  7.715312
7  5.274906  36.298129  0.004437  0.000096
8  0.004665   0.008162  0.046302  0.003867
9  0.650780   0.001144  0.862302  0.124197

In [141]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [142]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [143]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [144]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [145]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [146]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

### 11.9 Transposing

In [147]:
 # only show the first 5 rows
df[:5].T

          0         1         2         3         4
A -0.679671  0.533282  1.153310  0.810160 -0.033954
B -0.190971 -0.558180  0.846254  0.972695 -0.828464
C -0.318213  0.562976  0.070213  0.204095 -1.425595
D  0.525674  0.881030  1.669238  0.571347 -0.667835

In [148]:
dates = pd.date_range('20130101', periods=6)

In [149]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [150]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('TAHA'))

In [152]:
df

                   T         A         H         A
2013-01-01  0.453296 -1.986865 -0.704332  1.678422
2013-01-02 -0.174547 -0.163405 -0.130367  1.601520
2013-01-03 -0.547773 -0.566115 -1.753779  1.695296
2013-01-04  0.207750  0.114795  0.913539  0.244570
2013-01-05 -1.273823  0.069872 -0.587884 -1.265897
2013-01-06 -0.955672  0.290812 -0.920613  0.596918

In [153]:
df2 = pd.DataFrame({ 'A' : 1.,
                        'B' : pd.Timestamp('20130102'),
                        'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                        'D' : np.array([3] * 4,dtype='int32'),
                        'E' : pd.Categorical(["test","Taha","test","AI"]),
                        'F' : 'foo' })

In [154]:
df2

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo
1  1.0 2013-01-02  1.0  3  Taha  foo
2  1.0 2013-01-02  1.0  3  test  foo
3  1.0 2013-01-02  1.0  3    AI  foo

In [155]:
#Having specific dtypes
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## 12. Viewing Data

In [156]:
df.head() #display first 5 records

                   T         A         H         A
2013-01-01  0.453296 -1.986865 -0.704332  1.678422
2013-01-02 -0.174547 -0.163405 -0.130367  1.601520
2013-01-03 -0.547773 -0.566115 -1.753779  1.695296
2013-01-04  0.207750  0.114795  0.913539  0.244570
2013-01-05 -1.273823  0.069872 -0.587884 -1.265897

In [157]:
df.tail(3) #display last 3 records

                   T         A         H         A
2013-01-04  0.207750  0.114795  0.913539  0.244570
2013-01-05 -1.273823  0.069872 -0.587884 -1.265897
2013-01-06 -0.955672  0.290812 -0.920613  0.596918

In [158]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [159]:
df.columns #display coloumns

Index(['T', 'A', 'H', 'A'], dtype='object')

In [160]:
df.values # print values

array([[ 0.45329631, -1.98686461, -0.70433176,  1.67842196],
       [-0.17454739, -0.16340452, -0.13036709,  1.60152024],
       [-0.54777267, -0.56611525, -1.75377894,  1.69529634],
       [ 0.20775   ,  0.11479497,  0.91353922,  0.24457026],
       [-1.27382317,  0.06987204, -0.58788425, -1.26589708],
       [-0.95567198,  0.29081238, -0.9206127 ,  0.59691761]])

In [161]:
# Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
T    0.453296   -0.174547   -0.547773    0.207750   -1.273823   -0.955672
A   -1.986865   -0.163405   -0.566115    0.114795    0.069872    0.290812
H   -0.704332   -0.130367   -1.753779    0.913539   -0.587884   -0.920613
A    1.678422    1.601520    1.695296    0.244570   -1.265897    0.596918

In [162]:
 #Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   T         H         A         A
2013-01-01  0.453296 -0.704332 -1.986865  1.678422
2013-01-02 -0.174547 -0.130367 -0.163405  1.601520
2013-01-03 -0.547773 -1.753779 -0.566115  1.695296
2013-01-04  0.207750  0.913539  0.114795  0.244570
2013-01-05 -1.273823 -0.587884  0.069872 -1.265897
2013-01-06 -0.955672 -0.920613  0.290812  0.596918

In [4]:
import pandas as pd
import numpy as np

# Create the DataFrame
dates = pd.date_range('2013-01-01', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['T', 'H', 'A', 'A'])

# Now you can sort by a column
df_sorted = df.sort_values(by='H')  # Replace 'H' with your desired column name
print(df_sorted)

                   T         H         A         A
2013-01-06  0.874863 -1.627257  0.083776 -0.536444
2013-01-05  2.095122 -0.775471 -0.172476 -0.949045
2013-01-03  0.727796 -0.610306 -1.940319 -0.515120
2013-01-01 -0.925172 -0.232885  0.351592  0.450190
2013-01-02  0.726585  0.467108  1.038036 -0.020423
2013-01-04 -1.030102  1.672901 -1.312540 -0.915103

In [5]:
df.columns = ['T', 'H', 'A1', 'A2']

In [6]:
df.sort_values(by='H')

                   T         H        A1        A2
2013-01-06  0.874863 -1.627257  0.083776 -0.536444
2013-01-05  2.095122 -0.775471 -0.172476 -0.949045
2013-01-03  0.727796 -0.610306 -1.940319 -0.515120
2013-01-01 -0.925172 -0.232885  0.351592  0.450190
2013-01-02  0.726585  0.467108  1.038036 -0.020423
2013-01-04 -1.030102  1.672901 -1.312540 -0.915103

In [7]:
# Describe shows a quick statistic summary of your data
df.describe()

              T         H        A1        A2
count  6.000000  6.000000  6.000000  6.000000
mean   0.411515 -0.184318 -0.325322 -0.414324
std    1.192772  1.139208  1.103675  0.541169
min   -1.030102 -1.627257 -1.940319 -0.949045
25%   -0.512233 -0.734180 -1.027524 -0.820438
50%    0.727190 -0.421595 -0.044350 -0.525782
75%    0.838096  0.292110  0.284638 -0.144098
max    2.095122  1.672901  1.038036  0.450190

In [8]:
#Selecting a single column, which yields a Series, equivalent to df.A 
df['T']

2013-01-01   -0.925172
2013-01-02    0.726585
2013-01-03    0.727796
2013-01-04   -1.030102
2013-01-05    2.095122
2013-01-06    0.874863
Freq: D, Name: T, dtype: float64

In [9]:
#Selecting via [], which slices the rows. 
df[0:3]

                   T         H        A1        A2
2013-01-01 -0.925172 -0.232885  0.351592  0.450190
2013-01-02  0.726585  0.467108  1.038036 -0.020423
2013-01-03  0.727796 -0.610306 -1.940319 -0.515120

In [10]:
df['20130102':'20130104']

                   T         H        A1        A2
2013-01-02  0.726585  0.467108  1.038036 -0.020423
2013-01-03  0.727796 -0.610306 -1.940319 -0.515120
2013-01-04 -1.030102  1.672901 -1.312540 -0.915103

In [11]:
#Selecting on a multi-axis by label
df.loc[:,['T','H']]

                   T         H
2013-01-01 -0.925172 -0.232885
2013-01-02  0.726585  0.467108
2013-01-03  0.727796 -0.610306
2013-01-04 -1.030102  1.672901
2013-01-05  2.095122 -0.775471
2013-01-06  0.874863 -1.627257

In [14]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['T','H']]

                   T         H
2013-01-02  0.726585  0.467108
2013-01-03  0.727796 -0.610306
2013-01-04 -1.030102  1.672901

In [15]:
# Reduction in the dimensions of the returned object 
df.loc['20130102',['T','H']]

T    0.726585
H    0.467108
Name: 2013-01-02 00:00:00, dtype: float64

In [16]:
# For getting a scalar value 
df.loc[dates[0],'T']

np.float64(-0.9251721671597749)

In [17]:
# For getting fast access to a scalar 
df.at[dates[0],'T']

np.float64(-0.9251721671597749)

In [18]:
# Select via the position of the passed integers 
df.iloc[3]

T    -1.030102
H     1.672901
A1   -1.312540
A2   -0.915103
Name: 2013-01-04 00:00:00, dtype: float64

In [19]:
# By integer slices, acting similar to numpy/python 
df.iloc[3:5,0:2]

                   T         H
2013-01-04 -1.030102  1.672901
2013-01-05  2.095122 -0.775471

In [20]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   T        A1
2013-01-02  0.726585  1.038036
2013-01-03  0.727796 -1.940319
2013-01-05  2.095122 -0.172476

In [21]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   H        A1
2013-01-01 -0.232885  0.351592
2013-01-02  0.467108  1.038036
2013-01-03 -0.610306 -1.940319
2013-01-04  1.672901 -1.312540
2013-01-05 -0.775471 -0.172476
2013-01-06 -1.627257  0.083776

In [22]:
# For getting a value explicitly 
df.iloc[1,1]

np.float64(0.4671080317476909)

In [24]:
# Using a single column’s values to select data. 
df[df.T > 0]

             T   H  A1  A2
2013-01-01 NaN NaN NaN NaN
2013-01-02 NaN NaN NaN NaN
2013-01-03 NaN NaN NaN NaN
2013-01-04 NaN NaN NaN NaN
2013-01-05 NaN NaN NaN NaN
2013-01-06 NaN NaN NaN NaN

In [25]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   T         H        A1       A2
2013-01-01       NaN       NaN  0.351592  0.45019
2013-01-02  0.726585  0.467108  1.038036      NaN
2013-01-03  0.727796       NaN       NaN      NaN
2013-01-04       NaN  1.672901       NaN      NaN
2013-01-05  2.095122       NaN       NaN      NaN
2013-01-06  0.874863       NaN  0.083776      NaN

In [26]:
# Using the isin() method for filtering:
df2 = df.copy()

In [27]:
df2['E'] = ['one', 'one','two','three','four','three']

In [28]:
df2

                   T         H        A1        A2      E
2013-01-01 -0.925172 -0.232885  0.351592  0.450190    one
2013-01-02  0.726585  0.467108  1.038036 -0.020423    one
2013-01-03  0.727796 -0.610306 -1.940319 -0.515120    two
2013-01-04 -1.030102  1.672901 -1.312540 -0.915103  three
2013-01-05  2.095122 -0.775471 -0.172476 -0.949045   four
2013-01-06  0.874863 -1.627257  0.083776 -0.536444  three

In [29]:
 df2[df2['E'].isin(['two','four'])]

                   T         H        A1        A2     E
2013-01-03  0.727796 -0.610306 -1.940319 -0.515120   two
2013-01-05  2.095122 -0.775471 -0.172476 -0.949045  four

# ALLHAMDULILLAH DONE ASSIGNMENT NO: 1